tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "libsql/sqld"
tap "minio/stable"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "socsieng/tap"
tap "stripe/stripe-cli"
tap "tursodatabase/tap"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi", link: false
# Control Google Chrome from the command-line
brew "chrome-cli"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Visually compare two PDF files
brew "diff-pdf"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line tool for DigitalOcean
brew "doctl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Command-line interface for SQLite
brew "sqlite"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Open source relational database management system
brew "mysql-client"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI tool to extract (meta)data from PDF and manipulate PDF files
brew "pdfly"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Terraform
brew "hashicorp/tap/terraform"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
brew "tursodatabase/tap/turso"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Find files, folders, or contents in any file
cask "easyfind"
cask "font-sf-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source video transcoder
cask "handbrake-app"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Application launcher
cask "leader-key"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Multiplayer code editor
cask "zed"
vscode "akamud.vscode-theme-onelight"
vscode "atommaterial.a-file-icon-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "k--kato.intellij-idea-keybindings"
vscode "mads-hartmann.bash-ide-vscode"
vscode "meezilla.json"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "octref.vetur"
vscode "pinage404.bash-extension-pack"
vscode "rogalmic.bash-debug"
vscode "rpinski.shebang-snippets"
vscode "spmeesseman.vscode-taskexplorer"
vscode "timonwong.shellcheck"
cargo "ic-cdk-optimizer"
